#+SETUPFILE: ./setup.org

* Exploratory code

#+begin_src emacs-lisp :output raw
(let ((pages (org-lms-get-all-pages)))
  (cl-loop for p in pages
  collect (format "- [[%s][%s]]\n" (plist-get p :html_url)(plist-get p :title))
))
#+end_src

#+RESULTS:
| - [[https://q.utoronto.ca/courses/127426/pages/lectures][Lectures]] |
|------------|
|------------|

